УправлениеПаркомАтракционов/src/Documents/ШкалаБонуснойПрограммы/ШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШкалаБонуснойПрограммы</name>
  <registerRecords>InformationRegister.АктуальнаяШкалаБонуснойПрограмы</registerRecords>
  <tabularSections>
    <name>Диапозоны</name>
    <attributes>
      <name>НижнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАтракционов/src/InformationRegisters/АктуальнаяШкалаБонуснойПрограмы/АктуальнаяШкалаБонуснойПрограмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальнаяШкалаБонуснойПрограмы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Шкала</name>
    <type>
      <types>DocumentRef.ШкалаБонуснойПрограммы</types>
    </type>
  </resources>
</mdclass:InformationRegister>

УправлениеПаркомАтракционов/src/Documents/ШкалаБонуснойПрограммы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр АктуальнаяШкалаБонуснойПрограмы
	Движения.АктуальнаяШкалаБонуснойПрограмы.Записывать = Истина;
	Движение = Движения.АктуальнаяШкалаБонуснойПрограмы.Добавить();
	Движение.Период = Дата;
	Движение.Шкала = Ссылка;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// 1. Нижная граница первого диапозона должна быть равна 0
	// 2. Верхная граница каждого диапозона, кроме последнего, должна быть равно нижней следующего
	// 3. Верхная граница последнего диапозона должна быть равна 0
	// 4. Верхная граница всегда больше нижней границы (кроме последного диапозона)

	Если Диапозоны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Диапозоны[0].НижнаяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Нижная граница первого диапозона должна быть равна 0");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Диапозоны[0].НижнаяГраница";
		Сообщение.Сообщить();
	КонецЕсли;

	ВерхнаяГраницаПредыдущегоДиапозона = 0;

	Для Сч = 0 По Диапозоны.Количество() - 1 Цикл
		Диапозон = Диапозоны[Сч];

		Если Сч > 0 Тогда
			Если Диапозон.НижнаяГраница <> ВерхнаяГраницаПредыдущегоДиапозона Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Верхная граница диапозона должна быть равна нижней границе следующего");
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = СтрШаблон("Диапозоны[%1].НижнаяГраница", XMLСтрока(Сч));
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;

		Если Диапозон.НижнаяГраница >= Диапозон.ВерхнаяГраница И Сч <> Диапозоны.Количество() - 1 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Верхная граница должна быть всегда больше нижней границы");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = СтрШаблон("Диапозоны[%1].ВерхнаяГраница", XMLСтрока(Сч));
			Сообщение.Сообщить();
		КонецЕсли;

		ВерхнаяГраницаПредыдущегоДиапозона = Диапозон.ВерхнаяГраница;

	КонецЦикла;

	ПоследнийДиапозон = Диапозоны[Диапозоны.Количество() - 1];

	Если ПоследнийДиапозон.ВерхнаяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Верхная граница последнего диапозона должна быть равна 0");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = СтрШаблон("Диапозоны[%1].ВерхнаяГраница", XMLСтрока(Диапозоны.Количество()));
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
